Revit 2027 API
SubMenuItem Constructor
 Initialize the item data.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SubMenuItem(
	string name,
	ContextMenu subMenu
)
Public Sub New (
	name As String,
	subMenu As ContextMenu
)
public:
SubMenuItem(
	String^ name,
	ContextMenu^ subMenu
)
new :
        name : string *
        subMenu : ContextMenu -> SubMenuItem
Parameters
name String
 The name will show on menu.
subMenu ContextMenu
 The object of child ContextMenu.
Exceptions
Exception | Condition
ArgumentException |  name is an empty string or contains only whitespace.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SubMenuItem Class
Autodesk.Revit.UI Namespace